In [1]:
import pandas as pd

In [2]:
some_frame = pd.DataFrame(data={
    'col1': ['c11', 'c12', 'c13', 'c14'],
    'col2': ['c21', 'c22', 'c23', 'c24'],
    'col3': ['c31', 'c32', 'c33', 'c34'],
})

In [3]:
some_frame

  col1 col2 col3
0  c11  c21  c31
1  c12  c22  c32
2  c13  c23  c33
3  c14  c24  c34

In [4]:
col2_map = some_frame['col2'].map(lambda c: c != 'c22')

In [5]:
col2_map

0     True
1    False
2     True
3     True
Name: col2, dtype: bool

In [6]:
filtered_frame = some_frame[col2_map]

In [7]:
filtered_frame

  col1 col2 col3
0  c11  c21  c31
2  c13  c23  c33
3  c14  c24  c34